PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/io_pins/io_timer.c
static int allocate_channel(unsigned channel, io_timer_channel_mode_t mode)
{
	int rv = -EINVAL;

	if (mode != IOTimerChanMode_NotUsed) {
		rv = io_timer_validate_channel_index(channel);

		if (rv == 0) {
			rv = io_timer_allocate_channel(channel, mode);
		}
	}

	return rv;
}

static int timer_set_rate(unsigned timer, unsigned rate)
{
	/* configure the timer to update at the desired rate */

	rARR(timer) = (BOARD_PWM_FREQ / rate) - 1;

	return 0;
}



static inline void io_timer_set_oneshot_mode(unsigned timer)
{
	/* Ideally, we would want per channel One pulse mode in HW
	 * Alas OPE stops the Timer not the channel
	 * todo:We can do this in an ISR later
	 * But since we do not have that
	 * We try to get the longest rate we can.
	 *  On 16 bit timers this is 8.1 Ms.
	 *  On 32 but timers this is 536870.912
	 */

	rARR(timer) = 0xffffffff;
	rPSC(timer) = (io_timers[timer].clock_freq / BOARD_ONESHOT_FREQ) - 1;
	rEGR(timer) = GTIM_EGR_UG;
}

void io_timer_update_dma_req(uint8_t timer, bool enable)
{
	if (enable) {
		rDIER(timer) |= ATIM_DIER_UDE;

	} else {
		rDIER(timer) &= ~ATIM_DIER_UDE;
	}
}

void io_timer_capture_dma_req(uint8_t timer, uint8_t timer_channel_index, bool enable)
{
	if (enable) {
		switch (timer_channel_index) {
		case 0:
			rDIER(timer) |= ATIM_DIER_CC1DE;
			rEGR(timer)  |= (ATIM_EGR_UG | ATIM_EGR_CC1G);
			break;

		case 1:
			rDIER(timer) |= ATIM_DIER_CC2DE;
			rEGR(timer)  |= (ATIM_EGR_UG | ATIM_EGR_CC2G);
			break;

		case 2:
			rDIER(timer) |= ATIM_DIER_CC3DE;
			rEGR(timer)  |= (ATIM_EGR_UG | ATIM_EGR_CC3G);
			break;

		case 3:
			rDIER(timer) |= ATIM_DIER_CC4DE;
			rEGR(timer)  |= (ATIM_EGR_UG | ATIM_EGR_CC4G);
			break;
		}

	} else {
		switch (timer_channel_index) {
		case 0:
			rEGR(timer)  &= ~(ATIM_EGR_UG | ATIM_EGR_CC1G);
			rDIER(timer) &= ~ATIM_DIER_CC1DE;
			break;

		case 1:
			rEGR(timer)  &= ~(ATIM_EGR_UG | ATIM_EGR_CC2G);
			rDIER(timer) &= ~ATIM_DIER_CC2DE;
			break;

		case 2:
			rEGR(timer)  &= ~(ATIM_EGR_UG | ATIM_EGR_CC3G);
			rDIER(timer) &= ~ATIM_DIER_CC3DE;
			break;

		case 3:
			rEGR(timer)  &= ~(ATIM_EGR_UG | ATIM_EGR_CC4G);
			rDIER(timer) &= ~ATIM_DIER_CC4DE;
			break;
		}
	}
}

int io_timer_set_dshot_burst_mode(uint8_t timer, unsigned dshot_pwm_freq, uint8_t dma_burst_length)
{
	int ret_val = OK;
	uint32_t tim_dma_burst_length;

	if (1u == dma_burst_length) {
		tim_dma_burst_length = TIM_DMABURSTLENGTH_1TRANSFER;

	} else if (2u == dma_burst_length) {
		tim_dma_burst_length = TIM_DMABURSTLENGTH_2TRANSFERS;

	} else if (3u == dma_burst_length) {
		tim_dma_burst_length = TIM_DMABURSTLENGTH_3TRANSFERS;

	} else if (4u == dma_burst_length) {
		tim_dma_burst_length = TIM_DMABURSTLENGTH_4TRANSFERS;

	} else {
		ret_val = ERROR;
	}

	if (OK == ret_val) {
		rARR(timer)  = DSHOT_MOTOR_PWM_BIT_WIDTH;
		rPSC(timer)  = ((int)(io_timers[timer].clock_freq / dshot_pwm_freq) / DSHOT_MOTOR_PWM_BIT_WIDTH) - 1;
		rEGR(timer)  = ATIM_EGR_UG;

		// find the lowest channel index for the timer (they are not necessarily in ascending order)
		unsigned lowest_timer_channel = 4;
		uint32_t first_channel_index = io_timers_channel_mapping.element[timer].first_channel_index;
		uint32_t last_channel_index = first_channel_index + io_timers_channel_mapping.element[timer].channel_count;

		for (unsigned chan_index = first_channel_index; chan_index < last_channel_index; chan_index++) {
			if (timer_io_channels[chan_index].timer_channel < lowest_timer_channel) {
				lowest_timer_channel = timer_io_channels[chan_index].timer_channel;
			}
		}

		uint32_t start_ccr_register = 0;

		switch (lowest_timer_channel) {
		case 1: start_ccr_register = TIM_DMABASE_CCR1; break;

		case 2: start_ccr_register = TIM_DMABASE_CCR2; break;

		case 3: start_ccr_register = TIM_DMABASE_CCR3; break;

		case 4: start_ccr_register = TIM_DMABASE_CCR4; break;
		}

		rDCR(timer)  = start_ccr_register | tim_dma_burst_length;
	}

	return ret_val;
}

int io_timer_set_dshot_capture_mode(uint8_t timer, uint8_t timer_channel_index, unsigned dshot_pwm_freq)
{
	// Timer Autor Reload Register max value
	rARR(timer) = 0xFFFFFFFF;
	// Timer Prescalar
	rPSC(timer) = ((int)(io_timers[timer].clock_freq / (dshot_pwm_freq * 5 / 4)) / DSHOT_MOTOR_PWM_BIT_WIDTH) - 1;

	switch (timer_channel_index) {
	case 0:
		rEGR(timer) |= ATIM_EGR_UG | GTIM_EGR_CC1G;
		rCCER(timer) &= ~(GTIM_CCER_CC1E | GTIM_CCER_CC1P | HW_GTIM_CCER_CC1NP);
		rCCMR1(timer) |= (GTIM_CCMR_CCS_CCIN1 << GTIM_CCMR1_CC1S_SHIFT);
		rCCER(timer) |= (GTIM_CCER_CC1E | GTIM_CCER_CC1P | HW_GTIM_CCER_CC1NP);

		break;

	case 1:
		rEGR(timer) |= ATIM_EGR_UG | GTIM_EGR_CC2G;
		rCCER(timer) &= ~(GTIM_CCER_CC2E | GTIM_CCER_CC2P | HW_GTIM_CCER_CC2NP);
		rCCMR1(timer) |= (GTIM_CCMR_CCS_CCIN1 << GTIM_CCMR1_CC2S_SHIFT);
		rCCER(timer) |= (GTIM_CCER_CC2E | GTIM_CCER_CC2P | HW_GTIM_CCER_CC2NP);
		break;

	case 2:
		rEGR(timer) |= ATIM_EGR_UG | GTIM_EGR_CC3G;
		rCCER(timer) &= ~(GTIM_CCER_CC3E | GTIM_CCER_CC3P | HW_GTIM_CCER_CC3NP);
		rCCMR2(timer) |= (GTIM_CCMR_CCS_CCIN1 << GTIM_CCMR2_CC3S_SHIFT);
		rCCER(timer) |= (GTIM_CCER_CC3E | GTIM_CCER_CC3P | HW_GTIM_CCER_CC3NP);
		break;

	case 3:
		rEGR(timer) |= ATIM_EGR_UG | GTIM_EGR_CC4G;
		rCCER(timer) &= ~(GTIM_CCER_CC4E | GTIM_CCER_CC4P | HW_GTIM_CCER_CC4NP);
		rCCMR2(timer) |= (GTIM_CCMR_CCS_CCIN1 << GTIM_CCMR2_CC4S_SHIFT);
		rCCER(timer) |= (GTIM_CCER_CC4E | GTIM_CCER_CC4P | HW_GTIM_CCER_CC4NP);
		break;
	}

	return 0;
}

static inline void io_timer_set_PWM_mode(unsigned timer)
{
	rPSC(timer) = (io_timers[timer].clock_freq / BOARD_PWM_FREQ) - 1;
}

void io_timer_trigger(unsigned channels_mask)
{
	int oneshots = io_timer_get_mode_channels(IOTimerChanMode_OneShot) & channels_mask;

	if (oneshots != 0) {
		uint32_t action_cache[MAX_IO_TIMERS] = {0};
		int actions = 0;

		/* Pre-calculate the list of timers to Trigger */

		for (int timer = 0; timer < MAX_IO_TIMERS; timer++) {
			if (validate_timer_index(timer) == 0) {
				int channels = get_timer_channels(timer);

				if (oneshots & channels) {
					action_cache[actions++] = io_timers[timer].base;
				}
			}
		}

